it/src/DataProcessors/ЗагрузкаДанныхПоОС/ЗагрузкаДанныхПоОС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗагрузкаДанныхПоОС</name>
  <attributes>
    <name>Ф_ЗафиксироватьДанныеЗагрузки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ф_ПровестиСозданныеДокументы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокНастроек</name>
    <attributes>
      <name>Ф_Пометка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НастройкаПолученияДанныхОС</name>
      <type>
        <types>CatalogRef.НастройкиПолученияДанныхОС</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

it/src/Catalogs/НастройкиПолученияДанныхОС/НастройкиПолученияДанныхОС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НастройкиПолученияДанныхОС</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ф_ОтбиратьПоОрганизации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяДомена</name>
    <type>
      <types>CatalogRef.ИдентификаторыДоменов</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбновлятьКомпьютеры</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбновлятьОбъекты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокПодключений</name>
    <attributes>
      <name>УдалитьИмяДомена</name>
      <type>
        <types>CatalogRef.ИдентификаторыДоменов</types>
      </type>
    </attributes>
    <attributes>
      <name>ПользовательLDAP</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПарольLDAP</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РасположениеИнформацииОбОбъектахВОС</name>
    <attributes>
      <name>КаталогЗагрузки</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсторияЗагрузки</name>
    <attributes>
      <name>ДатаЗагрузки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДанныеОЗагрузки</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

it/src/DataProcessors/ЗагрузкаДанныхПоОС/Forms/Форма/Module.bsl
&НаСервере
Процедура ЗагрузитьДанныеНаСервере(Ф_НачальныеДанные = Ложь, Ф_ПоАД = Ложь, Ф_ПоОбъектам = Ложь)

	ТЗ_АнализаЗагрузки = Новый ТаблицаЗначений;
	
	Для каждого Стр_Списка Из Объект.СписокНастроек Цикл
		
		Если Стр_Списка.Ф_Пометка Тогда
			
			СтруктураНастройки = Новый Структура();
			СтруктураНастройки.Вставить("Ф_ЗафиксироватьДанныеЗагрузки",Объект.Ф_ЗафиксироватьДанныеЗагрузки);
			СтруктураНастройки.Вставить("Ф_ПровестиСозданныеДокументы",Объект.Ф_ПровестиСозданныеДокументы);
			
			Если Ф_ПоАД Тогда
				СтруктураНастройки.Вставить("Ф_НачальныеДанные",Ф_НачальныеДанные);
				
				ТЗ_Врем = УправлениеУчетнымиЗаписямиСервер.ЗагрузитьУчетныеЗаписиИзАДРегламентное(Стр_Списка.НастройкаПолученияДанныхОС, СтруктураНастройки);	
			КонецЕсли; 
			
			Если Ф_ПоОбъектам Тогда
				ТЗ_Врем = УправлениеУчетнымиЗаписямиСервер.ЗагрузитьДанныеИзРегламентное(Стр_Списка.НастройкаПолученияДанныхОС, СтруктураНастройки);	
			КонецЕсли; 
			
			Ф_ЗаписатьИсторию = Ложь;
			СтруктураНастройки.Свойство("Ф_ЗафиксироватьДанныеЗагрузки",Ф_ЗаписатьИсторию);
			
			Если ТЗ_АнализаЗагрузки.Количество() = 0 Тогда
				ТЗ_АнализаЗагрузки = ТЗ_Врем.Скопировать();
			Иначе
				Для каждого Стр_ТЗВрем Из ТЗ_Врем Цикл
				
					Стр_ТЗАнализа = ТЗ_АнализаЗагрузки.Добавить();	
					ЗаполнитьЗначенияСвойств(Стр_ТЗАнализа, Стр_ТЗВрем);
					
				КонецЦикла; 
			
			КонецЕсли; 
			
			Если Ф_ЗаписатьИсторию Тогда
			
				Спр_Об_Настройка = Стр_Списка.НастройкаПолученияДанныхОС.ПолучитьОбъект();	
				
				Стр_История = Спр_Об_Настройка.ИсторияЗагрузки.Добавить();
				Стр_История.ДатаЗагрузки 	= ТекущаяДата();
				Стр_История.ДанныеОЗагрузки = Новый ХранилищеЗначения(ТЗ_АнализаЗагрузки);
				
				Спр_Об_Настройка.Записать();
			
			КонецЕсли; 
		КонецЕсли; 
	
	КонецЦикла; 
	
	ТЗ_ОписаниеЗагружаемыхОбъектов.Очистить();
	ТЗ_ОписаниеЗагружаемыхОбъектов.Загрузить(ТЗ_АнализаЗагрузки);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьНачальныеДанныеПоАД(Команда)
	ЗагрузитьДанныеНаСервере(Истина, Истина, Ложь);	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзмененияПоАД(Команда)
	ЗагрузитьДанныеНаСервере(Ложь, Истина, Ложь);	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДанныеОбОбъектахВОС(Команда)
	ЗагрузитьДанныеНаСервере(Ложь, Ложь, Истина);	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИСТИНА КАК Ф_Пометка,
	               |	НастройкиПолученияДанныхОС.Ссылка КАК НастройкаПолученияДанныхОС
	               |ИЗ
	               |	Справочник.НастройкиПолученияДанныхОС КАК НастройкиПолученияДанныхОС
	               |ГДЕ
	               |	НЕ НастройкиПолученияДанныхОС.ПометкаУдаления";
	
	Объект.СписокНастроек.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры


&НаКлиенте
Процедура УстановитьВыбор(Выбор)
	Для Каждого Строка Из Объект.СписокНастроек Цикл
		Строка.Ф_Пометка = Выбор;
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура ВыбратьВсе(Команда)
	УстановитьВыбор(Истина);
КонецПроцедуры

&НаКлиенте
Процедура СнятьВыбор(Команда)
	УстановитьВыбор(Ложь);
КонецПроцедуры
